app/views/evaluations/index.html.erb

    <%# iterate through all evaluations, filtering by late and not submitted. %>
    <% Evaluation.all.filter {|evaluation| !evaluation.submitted && (DateTime.now() > evaluation.duedate)}.sort_by(&:duedate).each do |evaluation| %>
---
SELECT "evaluations".* FROM "evaluations"