app/views/evaluations/student.html.erb

<% provide(:nav_path, (render 'layouts/course_path', nav_path: ['To-Do Evaluations'])) %>
<% notSubmittedEvals = current_user.evaluations.select {|evaluation| !evaluation.submitted}%>
---
SELECT "evaluations".* FROM "evaluations" WHERE "evaluations"."user_id" = ?  [["user_id", 2]]

            <th scope="row"><%=evaluation.presentation.name%></th>
            <td><%= evaluation.presentation.users.map {|user| user.name}.join(",") %></td>
---
SELECT "presentations".* FROM "presentations" WHERE "presentations"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "users".* FROM "users" INNER JOIN "teams" ON "users"."id" = "teams"."user_id" WHERE "teams"."presentation_id" = ?  [["presentation_id", 2]]