app/views/static_pages/gradebook.html.erb

    <tbody>
    <% students = User.all.select {|user| !user.admin} %>
    <% students.each do |user| %>
        <% gradedPresentations = user.presentations.select {|presentation| presentation.grade}%>
---
SELECT "users".* FROM "users"
SELECT "presentations".* FROM "presentations" INNER JOIN "teams" ON "presentations"."id" = "teams"."presentation_id" WHERE "teams"."user_id" = ?  [["user_id", 2]]