app/views/announcements/index.html.erb

        <%# filter by duedate and submission, sort by date%>
        <% filtered_presentations = current_user.presentations.select {|presentation| (presentation.duedate < DateTime.now + 7) && (presentation.duedate >= DateTime.now)}.sort { |a,b| b.created_at <=> a.created_at } %>
        <% filtered_evaluations = current_user.evaluations.select {|evaluation| (evaluation.duedate < DateTime.now + 7) && (evaluation.duedate >= DateTime.now) && !evaluation.submitted}.sort { |a,b| b.created_at <=> a.created_at } %>
---
SELECT "presentations".* FROM "presentations" INNER JOIN "teams" ON "presentations"."id" = "teams"."presentation_id" WHERE "teams"."user_id" = ?  [["user_id", 12]]
SELECT "evaluations".* FROM "evaluations" WHERE "evaluations"."user_id" = ?  [["user_id", 12]]