app/views/presentations/index.html.erb

SELECT "presentations".* FROM "presentations"
---
    <%# iterates through all presentations %>
    <% Presentation.all.each do |presentation| %>

SELECT "users".* FROM "users" INNER JOIN "teams" ON "users"."id" = "teams"."user_id" WHERE "teams"."presentation_id" = ?  [["presentation_id", 1]]
---
            <%# format to string %>
            <td><%= presentation.users.map {|user| user.name}.join(', ') %></td>