app/views/presentations/show.html.erb

<% provide(:nav_path, (render 'layouts/course_path', nav_path: [parent_link, 'Evaluations for ' + @presentation.name])) %>
<% submittedEvals = @presentation.evaluations.select {|evaluation| evaluation.submitted}%>
---
SELECT "evaluations".* FROM "evaluations" WHERE "evaluations"."presentation_id" = ?  [["presentation_id", 1]]