app/views/presentations/student.html.erb

SELECT "presentations".* FROM "presentations" INNER JOIN "teams" ON "presentations"."id" = "teams"."presentation_id" WHERE "teams"."user_id" = ?  [["user_id", 3]]
SELECT "presentations".* FROM "presentations" INNER JOIN "teams" ON "presentations"."id" = "teams"."presentation_id" WHERE "teams"."user_id" = ?  [["user_id", 10]]
---
    <%# iterates through graded presentations %>
    <% gradedPresentations = current_user.presentations.select {|presentation| presentation.grade}%>
    <% current_user.presentations.all.each do |presentation| %>

SELECT "users".* FROM "users" INNER JOIN "teams" ON "users"."id" = "teams"."user_id" WHERE "teams"."presentation_id" = ?  [["presentation_id", 3]]
---
            <th scope="row"><%=presentation.name%></th>
            <td><%= presentation.users.map {|user| user.name}.join(', ') %></td>