app/views/users/index.html.erb

SELECT "users".* FROM "users"
---

    <% User.all.each do |user| %>