app/views/users/people.html.erb

    <hr>
    <% User.all.each do |u| %>
---
SELECT "users".* FROM "users"

    <hr>
    <% User.all.each do |u| %>
---
SELECT "users".* FROM "users"