app/views/users/show.html.erb

    <h1>To-do Presentations:</h1>
    <% @user.presentations.each do |p| %>
---
SELECT "presentations".* FROM "presentations" INNER JOIN "teams" ON "presentations"."id" = "teams"."presentation_id" WHERE "teams"."user_id" = ?  [["user_id", 1]]