app/helpers/users_helper.rb

  def student_list
    users = User.all
    students = []
    users.each do |user|
---
SELECT "users".* FROM "users"