app/controllers/announcements_controller.rb

SELECT "announcements".* FROM "announcements"
---
  def index
    @announcements = Announcement.all

INSERT INTO "announcements" ("text", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["text", "Do your SEIs"], ["created_at", "2022-12-06 18:44:33.328016"], ["updated_at", "2022-12-06 18:44:33.328016"], ["user_id", 1]]
---
  def create
    @announcement = current_user.announcements.build(announcement_params)
    if @announcement.save

DELETE FROM "announcements" WHERE "announcements"."id" = ?  [["id", 4]]
SELECT "announcements".* FROM "announcements" WHERE "announcements"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def destroy
    Announcement.find(params[:id]).destroy