app/controllers/evaluations_controller.rb

  def edit
    @evaluation = Evaluation.find(params[:id])
---
SELECT "evaluations".* FROM "evaluations" WHERE "evaluations"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]

  def update
    @evaluation = Evaluation.find(params[:id])
    @evaluation.update(eval_params)
    @evaluation.submitted = true
    if @evaluation.save
---
SELECT "evaluations".* FROM "evaluations" WHERE "evaluations"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "evaluations" SET "score" = ?, "evaluation" = ?, "updated_at" = ? WHERE "evaluations"."id" = ?  [["score", 8], ["evaluation", "Meh"], ["updated_at", "2022-12-06 16:15:20.929915"], ["id", 11]]

  def destroy
    Evaluation.find(params[:id]).destroy
---
DELETE FROM "evaluations" WHERE "evaluations"."id" = ?  [["id", 16]]
SELECT "evaluations".* FROM "evaluations" WHERE "evaluations"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]