app/controllers/presentations_controller.rb

  def create_presentation_users(ids)
    ids.each do |id|
      @presentation.users << User.find(id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]