app/controllers/presentations_controller.rb

  def index
    @presentations = Presentation.all
---
SELECT "presentations".* FROM "presentations"

  def create
    @presentation = Presentation.new(presentation_params)
    ids = user_ids[:users]
    ids.shift
    if @presentation.save
      ids.each do |id|
        @presentation.users << User.find(id)
---
INSERT INTO "presentations" ("name", "submitted", "grade", "duedate", "pointvalue", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users"
SELECT "presentations".* FROM "presentations" WHERE "presentations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" INNER JOIN "teams" ON "users"."id" = "teams"."user_id" WHERE "teams"."presentation_id" = ?  [["presentation_id", 1]]

  def edit
    @presentation = Presentation.find(params[:id])
---
SELECT "presentations".* FROM "presentations" WHERE "presentations"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def update
    @presentation = Presentation.find(params[:id])
    if @presentation.update(presentation_params)
---
SELECT "presentations".* FROM "presentations" WHERE "presentations"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "presentations" SET "grade" = ?, "updated_at" = ? WHERE "presentations"."id" = ?  [["grade", 8.0], ["updated_at", "2022-12-06 16:20:33.189293"], ["id", 4]]

  def show
    @presentation = Presentation.find(params[:id])
---
SELECT "presentations".* FROM "presentations" WHERE "presentations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    name = Presentation.find(params[:id]).name
    Presentation.find(params[:id]).destroy
---
SELECT "presentations".* FROM "presentations" WHERE "presentations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "presentations" WHERE "presentations"."id" = ?  [["id", 1]]

  def assign_evaluations(presentation)
    users = User.all
    presentation_users_ids = presentation.users.map(&:id)
    users.each do |user|
      # if user is a student who did not present
      next unless presentation_users_ids.exclude?(user.id) && !user.admin

      # automatically sends evaluations to each user due a week from the presentation date.
      eval = Evaluation.new(presentation_id: presentation.id, user_id: user.id,
                            duedate: presentation.duedate + 604_800)
      eval.save
---
SELECT "users".* FROM "users" INNER JOIN "teams" ON "users"."id" = "teams"."user_id" WHERE "teams"."presentation_id" = ?  [["presentation_id", 1]]
INSERT INTO "evaluations" ("score", "evaluation", "submitted", "duedate", "created_at", "updated_at", "presentation_id", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)