app/controllers/sessions_controller.rb

  def create
    # case-insensitive
    user = User.find_by(email: params[:session][:email].downcase)
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "chow.185@osu.edu"], ["LIMIT", 1]]