app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "admin", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])
    name = @user.name
    # only updates the admin potential
    @user.update_attribute(:admin, true)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "users" SET "admin" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["admin", 1], ["updated_at", "2022-12-06 20:08:46.793019"], ["id", 12]]

  def destroy
    name = User.find(params[:id]).name
    User.find(params[:id]).destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 6]]